---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroModule.Name
source: html/8680a185-af3c-c202-d252-0c6ecdf752f0.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.Name Property

The name of the module.

## Syntax (C#)
```csharp
public string Name { get; }
```